In [21]:
import pandas as pd
import numpy  as np

data = pd.read_csv('Salaries.csv')
data.head(10).to_string()

C:\Users\USER\AppData\Roaming\Python\Python310\site-packages\IPython\core\interactiveshell.py:3505: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

'   Id        EmployeeName                                        JobTitle    BasePay OvertimePay   OtherPay Benefits   TotalPay  TotalPayBenefits  Year  Notes         Agency Status\n0   1      NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  167411.18         0.0  400184.25      NaN  567595.43         567595.43  2011    NaN  San Francisco    NaN\n1   2        GARY JIMENEZ                 CAPTAIN III (POLICE DEPARTMENT)  155966.02   245131.88  137811.38      NaN  538909.28         538909.28  2011    NaN  San Francisco    NaN\n2   3      ALBERT PARDINI                 CAPTAIN III (POLICE DEPARTMENT)  212739.13   106088.18    16452.6      NaN  335279.91         335279.91  2011    NaN  San Francisco    NaN\n3   4   CHRISTOPHER CHONG            WIRE ROPE CABLE MAINTENANCE MECHANIC    77916.0    56120.71   198306.9      NaN  332343.61         332343.61  2011    NaN  San Francisco    NaN\n4   5     PATRICK GARDNER    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)   134401.6      9737.0  182234.59      NaN  326373.19         326373.19  2011    NaN  San Francisco    NaN\n5   6      DAVID SULLIVAN                       ASSISTANT DEPUTY CHIEF II   118602.0      8601.0  189082.74      NaN  316285.74         316285.74  2011    NaN  San Francisco    NaN\n6   7           ALSON LEE              BATTALION CHIEF, (FIRE DEPARTMENT)   92492.01     89062.9  134426.14      NaN  315981.05         315981.05  2011    NaN  San Francisco    NaN\n7   8       DAVID KUSHNER                  DEPUTY DIRECTOR OF INVESTMENTS  256576.96         0.0    51322.5      NaN  307899.46         307899.46  2011    NaN  San Francisco    NaN\n8   9      MICHAEL MORRIS              BATTALION CHIEF, (FIRE DEPARTMENT)  176932.64    86362.68   40132.23      NaN  303427.55         303427.55  2011    NaN  San Francisco    NaN\n9  10  JOANNE HAYES-WHITE          CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)   285262.0         0.0   17115.73      NaN  302377.73         302377.73  2011    NaN  San Francisco    NaN'

In [22]:
# Check Last 10 Rows of The Dataset
data.tail(10).to_string()

'            Id      EmployeeName                      JobTitle       BasePay   OvertimePay      OtherPay      Benefits  TotalPay  TotalPayBenefits  Year  Notes         Agency Status\n148644  148645      Randy D Winn  Stationary Eng, Sewage Plant          0.00          0.00          0.00          0.00      0.00              0.00  2014    NaN  San Francisco     PT\n148645  148646  Carolyn A Wilson     Human Services Technician          0.00          0.00          0.00          0.00      0.00              0.00  2014    NaN  San Francisco     PT\n148646  148647      Not provided                  Not provided  Not Provided  Not Provided  Not Provided  Not Provided      0.00              0.00  2014    NaN  San Francisco    NaN\n148647  148648    Joann Anderson   Communications Dispatcher 2          0.00          0.00          0.00          0.00      0.00              0.00  2014    NaN  San Francisco     PT\n148648  148649       Leon Walker                     Custodian          0.00          0.00          0.00          0.00      0.00              0.00  2014    NaN  San Francisco     PT\n148649  148650     Roy I Tillery                     Custodian          0.00          0.00          0.00          0.00      0.00              0.00  2014    NaN  San Francisco     PT\n148650  148651      Not provided                  Not provided  Not Provided  Not Provided  Not Provided  Not Provided      0.00              0.00  2014    NaN  San Francisco    NaN\n148651  148652      Not provided                  Not provided  Not Provided  Not Provided  Not Provided  Not Provided      0.00              0.00  2014    NaN  San Francisco    NaN\n148652  148653      Not provided                  Not provided  Not Provided  Not Provided  Not Provided  Not Provided      0.00              0.00  2014    NaN  San Francisco    NaN\n148653  148654         Joe Lopez    Counselor, Log Cabin Ranch          0.00          0.00       -618.13          0.00   -618.13           -618.13  2014    NaN  San Francisco     PT'

In [7]:
# Find Shape of Our Dataset (Number of Rows And Number of Columns)
print("Shape of dataset",data.shape)
print("Number of row",data.shape[0])
print("Number of column",data.shape[1])

Shape of dataset (148654, 13)
Number of row 148654
Number of column 13

In [23]:
# Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column 
# And Memory Requirement
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [24]:
# Check null values in the dataset
data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [17]:
# Drop ID, Notes, Agency, and Status Columns
data = data.drop(['Id','Notes','Agency','Status'],axis=1)
data.head()

EmployeeName            0
JobTitle                0
BasePay               605
OvertimePay             0
OtherPay                0
Benefits            36159
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [26]:
# Get Overall Statistics About The Dataframe
data.describe(include='all')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
count,148654.000000,148654,148654,148049.0,148654.0,148654.0,112495.0,148654.000000,148654.000000,148654.000000,0.0,148654,38119
unique,NaN,110811,2159,109900.0,66555.0,84968.0,99635.0,NaN,NaN,NaN,NaN,1,2
top,NaN,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,San Francisco,FT
freq,NaN,13,7036,875.0,66103.0,35218.0,1053.0,NaN,NaN,NaN,NaN,148654,22334
mean,74327.500000,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643,NaN,NaN,NaN
std,42912.857795,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000,NaN,NaN,NaN
25%,37164.250000,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000,NaN,NaN,NaN
50%,74327.500000,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000,NaN,NaN,NaN
75%,111490.750000,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000,NaN,NaN,NaN
max,148654.000000,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000,NaN,NaN,NaN

In [28]:
# Find Occurrence of The Employee Names  (Top 5)
data['EmployeeName'].value_counts().head()

Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: EmployeeName, dtype: int64

In [29]:
# Find The Number of Unique Job Titles
data['JobTitle'].nunique()

2159

In [32]:
# Total Number of Job Titles Contain Captain
len(data[data['JobTitle'].str.contains('CAPTAIN')])

141

In [34]:
# Display All the Employee Names From Fire Department
data[data['JobTitle'].str.contains('fire',case=False)]['EmployeeName']

4            PATRICK GARDNER
6                  ALSON LEE
8             MICHAEL MORRIS
9         JOANNE HAYES-WHITE
10             ARTHUR KENNEY
                 ...
145956      Kenneth C Farris
147556         Edward A Dunn
148021        Kari A Johnson
148209          Sheryl K Lee
148554       Lawrence F Gatt
Name: EmployeeName, Length: 5879, dtype: object

In [38]:
# Find Minimum, Maximum, and Average BasePay
data['BasePay'].describe()

count     148049.0
unique    109900.0
top            0.0
freq         875.0
Name: BasePay, dtype: float64

In [42]:
# Replace 'Not Provided' in EmployeeName' Column to NaN 
data['EmployeeName'].replace("Not provided",np.nan)

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [43]:
# Drop The Rows Having 5 Missing Values
data[data.isnull().sum(axis=1)==5]

Empty DataFrame
Columns: [Id, EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year, Notes, Agency, Status]
Index: []

In [45]:
# Find Job Title of ALBERT PARDINI
data[data['EmployeeName']=="ALBERT PARDINI"]['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

In [46]:
# How Much ALBERT PARDINI Make (Include Benefits)?
data[data['EmployeeName']=="ALBERT PARDINI"]['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

In [57]:
# Find Average of All Employee Per Year 
data.groupby('Year').mean()

            Id      TotalPay  TotalPayBenefits  Notes
Year
2011   18080.0  71744.103871      71744.103871    NaN
2012   54542.5  74113.262265     100553.229232    NaN
2013   91728.5  77611.443142     101440.519714    NaN
2014  129593.0  75463.918140     100250.918884    NaN

In [58]:
# Find Average of All Employee Per JobTitle 
data.groupby('JobTitle').mean()

,Id,TotalPay,TotalPayBenefits,Year,Notes
JobTitle,,,,,
ACCOUNT CLERK,25734.819277,44035.664337,44035.664337,2011.00,NaN
ACCOUNTANT,24159.200000,47429.268000,47429.268000,2011.00,NaN
ACCOUNTANT INTERN,28128.833333,29031.742917,29031.742917,2011.00,NaN
"ACPO,JuvP, Juv Prob (SFERS)",135284.000000,62290.780000,80266.370000,2014.00,NaN
ACUPUNCTURIST,18379.000000,67594.400000,67594.400000,2011.00,NaN
...,...,...,...,...,...
X-RAY LABORATORY AIDE,22502.076923,52705.880385,52705.880385,2011.00,NaN
X-Ray Laboratory Aide,98890.620000,50823.942700,69521.123200,2013.04,NaN
"YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS",23392.000000,53632.870000,53632.870000,2011.00,NaN
Youth Comm Advisor,99677.750000,41414.307500,60118.550000,2013.00,NaN
ZOO CURATOR,18779.000000,66686.560000,66686.560000,2011.00,NaN

In [59]:
# Find Average of Employee Having Job Title ACCOUNTANT
data[data['JobTitle']=='ACCOUNTANT'].mean()

C:\Users\USER\AppData\Local\Temp\ipykernel_41852\2801329582.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data[data['JobTitle']=='ACCOUNTANT'].mean()

Id                  24159.200
BasePay             46643.172
OvertimePay             0.000
OtherPay              786.096
Benefits                  NaN
TotalPay            47429.268
TotalPayBenefits    47429.268
Year                 2011.000
Notes                     NaN
Status                    NaN
dtype: float64

In [61]:
# Find Top 5 Most Common Jobs
data['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64